Revit 2026 API

# FailureMessageAccessorHasResolutions Method

---

Checks if the failure has any resolutions.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool HasResolutions()
```
```vb
Public Function HasResolutions As Boolean
```
```cpp
public:
bool HasResolutions()
```
```fsharp
member HasResolutions : unit -> bool
```

#### Return Value

Boolean True if the failure has any resolutions, false otherwise.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This FailureMessageAccessor has not been properly initialized. |

#### Reference

FailureMessageAccessor Class

Autodesk.Revit.DB Namespace